---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyle.FontHorizontalAlignment
source: html/151939b8-8720-76d8-ef5f-b5ac3bdcadad.htm
---
# Autodesk.Revit.DB.TableCellStyle.FontHorizontalAlignment Property

The horizontal alignment style of text font.

## Syntax (C#)
```csharp
public HorizontalAlignmentStyle FontHorizontalAlignment { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration